Public Attributes | List of all members
API_PictureType Struct Reference
Element Manager API
Represents a figure (picture) element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
bool  | mirrored
True if mirrored to local vertical axis.
bool  | usePixelSize
Has meaning only when creating the picture, see the table below.
short  | pixelSizeX
Physical x size in pixels (When creating the picture and usePixelSize is true, then the logical x size in pixels of the current zoom. See the table below.)
short  | pixelSizeY
Physical y size in pixels (When creating the picture and usePixelSize is true, then the logical y size in pixels of the current zoom. See the table below.)
bool  | transparent
White pixels of the picture are drawn transparently.
bool  | directCreate
Create the picture element without parameter checking and re-calculating (input only).
double  | rotAngle
Rotation angle.
API_Box  | destBox
Current box of the picture (when creating the picture, see the table below).
API_Box  | origBox
Original box of the picture.
API_ColorDepthID  | colorDepth
Color depth of the image, see API_ColorDepthID.
API_AnchorID  | anchorPoint
Anchor point of core, see API_AnchorID.
API_PictureFormat  | storageFormat
Storage format of the picture.
GS::uchar_t  | pictName [API_UniLongNameLen]
Name of the picture as a Unicode string.
char  | mime [128]
MIME string identifying the image format (output only).
Detailed Description
Represents a figure (picture) element.
Remarks
Possible values:
creating (usePixelSize is true)  | creating (usePixelSize is false)
 mirrored  | required
 pixelSizeX  | required  | ignored
 pixelSizeY  | required  | ignored
 rotAngle  | required
 destBox: xMin, yMin  | required (insert position)
 destBox: xMax, yMax  | ignored  | required
 origBox  | ignored
 colorDepth  | ignored
 anchorPoint  | required
 storageFormat  | required
 pictName  | optional
 Creating
 Picture destination box
 Not creating
 Picture with pixel size
 Use the directCreate option if you do not want the parameters you passed to be checked and re-calculated.
Member Data Documentation
◆ anchorPoint
 API_PictureType::anchorPoint
Anchor point of core, see API_AnchorID.
◆ colorDepth
 API_PictureType::colorDepth
Color depth of the image, see API_ColorDepthID.
◆ destBox
 API_PictureType::destBox
Current box of the picture (when creating the picture, see the table below).
◆ directCreate
 API_PictureType::directCreate
Create the picture element without parameter checking and re-calculating (input only).
◆ head
 API_PictureType::head
General element header.
◆ mime
 API_PictureType::mime
MIME string identifying the image format (output only).
◆ mirrored
 API_PictureType::mirrored
True if mirrored to local vertical axis.
◆ origBox
 API_PictureType::origBox
Original box of the picture.
◆ pictName
 API_PictureType::pictName
Name of the picture as a Unicode string.
◆ pixelSizeX
 API_PictureType::pixelSizeX
Physical x size in pixels (When creating the picture and usePixelSize is true, then the logical x size in pixels of the current zoom. See the table below.)
◆ pixelSizeY
 API_PictureType::pixelSizeY
Physical y size in pixels (When creating the picture and usePixelSize is true, then the logical y size in pixels of the current zoom. See the table below.)
◆ rotAngle
 API_PictureType::rotAngle
Rotation angle.
◆ storageFormat
 API_PictureType::storageFormat
Storage format of the picture.
◆ transparent
 API_PictureType::transparent
White pixels of the picture are drawn transparently.
◆ usePixelSize
 API_PictureType::usePixelSize
Has meaning only when creating the picture, see the table below.